### Задание 2 
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity

In [72]:
import pandas as pd

In [3]:
#Импортируем файл power.csv
data_power = pd.read_csv('power.csv')
data_power.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [46]:
#Найдем значения стран при помощи метода str.contains
data_power[ data_power['country'].str.contains('lit', case=False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [47]:
data_power[ data_power['country'].str.contains('lat', case=False)]['country'].unique()

array(['Latvia'], dtype=object)

In [49]:
data_power[ data_power['country'].str.contains('sto', case=False)]['country'].unique()

array(['Estonia'], dtype=object)

In [50]:
def pribaltic (country):
    """опеределение при надлежности страны к странам прибалтики по наименованию"""
    
    if country in ['Lithuania', 'Latvia', 'Estonia']:
        return 'Baltics'
    return 'not the Baltics'

In [5]:
#добавим столбец, определяющий принадлежность к странам Балтики путем применения функции pribaltic к столбцу country
data_power['baltic'] = data_power.country.apply(pribaltic)

In [6]:
#Посмотрим результат применения функции. Столбец добавился
data_power.head()

   country  year  quantity  category           baltic
0  Austria  1996       5.0         1  not the Baltics
1  Austria  1995      17.0         1  not the Baltics
2  Belgium  2014       0.0         1  not the Baltics
3  Belgium  2013       0.0         1  not the Baltics
4  Belgium  2012      35.0         1  not the Baltics

In [7]:
#cоздаем новый ДФ только со странами прибалтики и убираем отрицательные значения по quantity
data_baltic = data_power[(data_power['baltic'] == 'Baltics') & (data_power['quantity'] >= 0)]

In [8]:
data_baltic.head(10)

       country  year  quantity  category   baltic
373  Lithuania  2014      39.0         1  Baltics
374  Lithuania  2013     192.0         1  Baltics
375  Lithuania  2012     196.0         1  Baltics
376  Lithuania  2011     171.0         1  Baltics
377  Lithuania  2010     158.0         1  Baltics
378  Lithuania  2009     158.0         1  Baltics
379  Lithuania  2008     100.0         1  Baltics
380  Lithuania  2007     105.0         1  Baltics
956  Lithuania  2014       0.0         1  Baltics
957  Lithuania  2013       0.0         1  Baltics

In [9]:
#Фильтруем столбцы по году от 2005 по 2010
data_baltic_year = data_baltic[ (data_baltic['year'] < 2010) & (data_baltic['year'] > 2005) ]

In [51]:
data_baltic_year

           country  year  quantity  category   baltic
378      Lithuania  2009     158.0         1  Baltics
379      Lithuania  2008     100.0         1  Baltics
380      Lithuania  2007     105.0         1  Baltics
961      Lithuania  2009       3.0         1  Baltics
962      Lithuania  2008       9.0         1  Baltics
...            ...   ...       ...       ...      ...
1188840     Latvia  2006      46.0        71  Baltics
1188856  Lithuania  2009     158.0        71  Baltics
1188857  Lithuania  2008     131.0        71  Baltics
1188858  Lithuania  2007     106.0        71  Baltics
1188859  Lithuania  2006      14.0        71  Baltics

[5479 rows x 5 columns]

In [30]:
#Задаем условия фильтрации по категориям 4, 12, 24
data_baltic_itog = data_baltic_year[(data_baltic_year['category'] == 4) | (data_baltic_year['category'] == 12) | (data_baltic_year['category'] == 21)]

In [31]:
#Расчитываем суммарное потребление с учетом ранее заданных условий:
Для стран прибалтики за 2005-2010гг всех указанных категорий (4,12,21)
data_baltic_itog['quantity'].sum()

164555.0

In [43]:
data_baltic_itog.sort_values(['category']).head(100)

          country  year  quantity  category   baltic
10617     Estonia  2008       1.0         4  Baltics
18220   Lithuania  2006       1.0         4  Baltics
19854     Estonia  2008       1.0         4  Baltics
19855     Estonia  2007       0.0         4  Baltics
19856     Estonia  2006       3.0         4  Baltics
...           ...   ...       ...       ...      ...
104821  Lithuania  2007      74.0        12  Baltics
104822  Lithuania  2006       1.0        12  Baltics
104143  Lithuania  2008       1.0        12  Baltics
105475  Lithuania  2007       1.0        12  Baltics
109220  Lithuania  2008       1.0        12  Baltics

[100 rows x 5 columns]

In [55]:
#Суммарное потребление стран прибалтики 4-й категории
data_baltic_itog_4 = data_baltic_year[ (data_baltic_year['category'] == 4) ]
data_baltic_itog_4['quantity'].sum()

24.0

In [56]:
#Суммарное потребление стран прибалтики 12-й категории
data_baltic_itog_12 = data_baltic_year[ (data_baltic_year['category'] == 12) ]
data_baltic_itog_12['quantity'].sum()

5363.0

In [57]:
#Суммарное потребление стран прибалтики 21-й категории
data_baltic_itog_21 = data_baltic_year[ (data_baltic_year['category'] == 21) ]
data_baltic_itog_21['quantity'].sum()

159168.0

### Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [58]:
data_movies = pd.read_csv('movies.csv')
data_ratigs = pd.read_csv('ratings.csv')

In [59]:
data_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [62]:
data_ratigs.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [60]:
filtr_data = data_ratigs[ data_ratigs['rating'] == 5]
filtr_data.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [63]:
filtr_data['movieId'].value_counts().sort_values(ascending=False)

318      153
296      123
356      116
2571     109
260      104
        ...
1150       1
3223       1
1416       1
1590       1
83969      1
Name: movieId, Length: 2954, dtype: int64

In [64]:
movies = data_movies[ data_movies['movieId'] == 318]

In [65]:
movies['title']

277    Shawshank Redemption, The (1994)
Name: title, dtype: object

### Задание 3
Задание 3 Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти): https://fortrader.org/quotes www.finanz.ru...om-vremeni

In [87]:
smart_list = pd.read_html('https://smart-lab.ru/q/ofz/')[0]

In [91]:
smart_list.head()

,№,Unnamed: 1,Имя,Unnamed: 3,Погашение,Лет допогаш.,Доходн,!,Год.куп.дох.,Куп.дох.посл.,Цена,"Объем,млн руб","Купон, руб","Частота,раз в год","НКД, руб","Дюр-я, лет",Дата купона,Unnamed: 17,Unnamed: 18
0,1,18:36:17,ОФЗ 26237,NaN,2029-03-14,7.1,9.5%,NaN,6.70%,7.74%,86.60,1 223.7,33.41,2,25.33,5.51,2022-03-23,+,+
1,2,18:39:09,ОФЗ 26209,NaN,2022-07-20,0.5,9.7%,NaN,7.60%,7.66%,99.19,1 049.5,37.90,2,3.96,0.46,2022-07-20,+,+
2,3,18:35:49,ОФЗ 26239,NaN,2031-07-23,9.5,9.4%,NaN,6.90%,8.06%,85.65,255.3,34.41,2,0.95,6.90,2022-08-03,+,+
3,4,18:37:52,ОФЗ 26234,NaN,2025-07-16,3.5,9.5%,NaN,4.50%,5.22%,86.16,248.6,22.44,2,2.34,3.21,2022-07-20,+,+
4,5,18:37:15,ОФЗ 26229,NaN,2025-11-12,3.8,9.5%,NaN,7.15%,7.66%,93.33,237.8,35.65,2,16.06,3.31,2022-05-18,+,+

In [90]:
smart_list['Имя'].nunique()

55